Revit 2026 API

# MaterialNode Methods

---

The MaterialNode type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | (Inherited from RenderNode) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetAppearance | Appearance properties associated with the material. |
|  | GetAppearanceOverride | Returns appearance properties that override the preset appearance of the material. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

MaterialNode Class

Autodesk.Revit.DB Namespace